eisup_2019_docmng_integration/src/Catalogs/абс_ПравилаЗагрузкиПакетовДанных/абс_ПравилаЗагрузкиПакетовДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>абс_ПравилаЗагрузкиПакетовДанных</name>
  <attributes>
    <name>ТипФайлаЗагрузки</name>
    <comment>xls, dbf, csv</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеЗагрузки</name>
    <comment>Документ/справочник, в который загружаются данные</comment>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделительФайлаЗагрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПервойСтрокиДляЗагрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПравилаЗагрузкиОбъектов</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>DocumentRef</types>
        <types>EnumRef</types>
        <types>ChartOfAccountsRef</types>
        <types>CatalogRef</types>
        <numberQualifiers>
          <precision>32</precision>
          <scale>9</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>999</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Правило</name>
      <type>
        <types>CatalogRef.абс_ПравилаЗагрузкиДанных</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗагрузкаВТабличнуюЧасть</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТабличнаяЧасть</name>
      <comment>Имя табличной части (как задано в конфигураторе)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитНазначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеТабЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИспользуетсяПравило</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДляПодстановки</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>DocumentRef</types>
        <types>EnumRef</types>
        <types>ChartOfAccountsRef</types>
        <types>CatalogRef</types>
        <numberQualifiers>
          <precision>32</precision>
          <scale>9</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>999</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоступныеТипы</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоляФайла</name>
    <attributes>
      <name>НомерКолонки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объект</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>DocumentRef</types>
        <types>EnumRef</types>
        <types>ChartOfAccountsRef</types>
        <types>CatalogRef</types>
        <numberQualifiers>
          <precision>32</precision>
          <scale>9</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>999</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗагрузкаВТабличнуюЧасть</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТабличнаяЧасть</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитНазначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Catalogs/абс_ПравилаЗагрузкиДанных/абс_ПравилаЗагрузкиДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>абс_ПравилаЗагрузкиДанных</name>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НеСоздаватьНовыхЭлементов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяНумерацияКолонокТабличногоДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимЗагрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаИсточника</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабличнаяЧастьИсточника</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПередЗаписьюОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриЗаписиОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПослеДобавленияСтроки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяВидаРегистра</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗамещатьСуществующиеЗаписи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТаблицаЗагружаемыхРеквизитов</name>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеРеквизита</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>МожетБытьПолемПоиска</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПолеПоиска</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоступноеОписаниеТипов</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеТипов</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>РежимЗагрузки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерКолонки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоУмолчанию</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>32</precision>
          <scale>9</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>999</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоУмолчаниюОписаниеТипов</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>Выражение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИскатьПо</name>
      <comment>Описание типов</comment>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>32</precision>
          <scale>9</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>999</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СвязьПоВладельцу</name>
      <comment>Описание типов</comment>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>32</precision>
          <scale>9</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>999</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СвязьПоТипу</name>
      <comment>Описание типов</comment>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>32</precision>
          <scale>9</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>999</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭлементСвязиПоТипу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШиринаКолонки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Catalogs/абс_ПравилаЗагрузкиПакетовДанных/ObjectModule.bsl
Процедура УдалитьЛишниеПоляФайла(ТекСтрокаПравилаЗагрузкиОбъектов)  Экспорт
	// Вставить содержимое обработчика.
	ОбъектОтбора = ТекСтрокаПравилаЗагрузкиОбъектов.Объект;
	ЗагрузкаВТабличнуюЧасть = ТекСтрокаПравилаЗагрузкиОбъектов.ЗагрузкаВТабличнуюЧасть;
	ТабличнаяЧасть = ТекСтрокаПравилаЗагрузкиОбъектов.ТабличнаяЧасть;
	РеквизитНазначения = ТекСтрокаПравилаЗагрузкиОбъектов.РеквизитНазначения;
	СтруктураОтбора = Новый Структура("Объект,ЗагрузкаВТабличнуюЧасть,ТабличнаяЧасть,РеквизитНазначения");
	
	СтруктураОтбора.Объект = ОбъектОтбора;
	СтруктураОтбора.ЗагрузкаВТабличнуюЧасть = ЗагрузкаВТабличнуюЧасть; 
	СтруктураОтбора.ТабличнаяЧасть = ТабличнаяЧасть;   
	СтруктураОтбора.РеквизитНазначения = РеквизитНазначения;
	
	МассивСтрок = ПоляФайла.НайтиСтроки(СтруктураОтбора);
	
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	абс_ПравилаЗагрузкиДанныхТЧТаблицаЗагружаемыхРеквизитов.ИмяРеквизита,
	|	абс_ПравилаЗагрузкиДанныхТЧТаблицаЗагружаемыхРеквизитов.ПредставлениеРеквизита
	|ИЗ
	|	Справочник.абс_ПравилаЗагрузкиДанных.ТЧТаблицаЗагружаемыхРеквизитов КАК абс_ПравилаЗагрузкиДанныхТЧТаблицаЗагружаемыхРеквизитов
	|ГДЕ
	|	абс_ПравилаЗагрузкиДанныхТЧТаблицаЗагружаемыхРеквизитов.Пометка
	|	И (абс_ПравилаЗагрузкиДанныхТЧТаблицаЗагружаемыхРеквизитов.РежимЗагрузки = ""Искать""
	|			ИЛИ абс_ПравилаЗагрузкиДанныхТЧТаблицаЗагружаемыхРеквизитов.РежимЗагрузки = ""Вычислять"")
	|	И абс_ПравилаЗагрузкиДанныхТЧТаблицаЗагружаемыхРеквизитов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",ТекСтрокаПравилаЗагрузкиОбъектов.Правило);
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаПоляФайла из МассивСтрок Цикл
		Удалять = Истина;
		Для каждого СтрокаТЗ из ТЗ Цикл
			Если СтрокаПоляФайла.ИмяРеквизита = СтрокаТЗ.ИмяРеквизита Тогда
				Удалять = Ложь;
				прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Удалять Тогда
			ПоляФайла.Удалить(СтрокаПоляФайла);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПРоцедуры
